# Core CLI tools
brew "git"
brew "neovim"
brew "tmux"
brew "stow"
brew "tree"
brew "curl"
brew "jq"
brew "fx"         # TUI for JSON
brew "watch"
brew "duckdb"
brew "pstree"
brew "opencode"
brew "mc"         # Directory TUI
brew "posting"    # HTTP API TUI, bring the postman website into the term
brew "ncdu"       # TUI replacement for du
brew "btop"       # TUI hardware perf monitor
brew "ntfy"       # CLI to send notifications

# Modern replacements
brew "fd"         # find replacement
brew "ripgrep"    # grep replacement
brew "fzf"        # fuzzy finder
brew "zoxide"     # smarter cd
brew "sd"         # An intuitive find & replace CLI
brew "eza"
brew "delta"
brew "difftastic"
brew "bat"
brew "glow"
brew "just"       # Modern make files
brew "zsh"        # Better Bash
brew "nu"         # Non-POSIX shell focused on making piping amazing

# Build tools
brew "cmake"
brew "automake"
brew "libtool"
brew "gnu-tar"
brew "shellcheck"
brew "uv"
brew "entr"       # Monitor for file changes and run a command

# Cask applications
cask "ghostty"
cask "iterm2"
cask "google-chrome"
cask "intellij-idea-ce"
cask "font-jetbrains-mono-nerd-font"
