# Core CLI tools
brew "git"        # Distributed version control system
brew "neovim"     # Hyperextensible Vim-based text editor
brew "tmux"       # Terminal multiplexer for persistent sessions
brew "stow"       # Symlink farm manager for dotfiles
brew "tree"       # Display directory structure as a tree
brew "curl"       # Command-line HTTP client
brew "jq"         # JSON processor and query language
brew "fx"         # TUI for JSON
brew "watch"      # Execute a command periodically and display output
brew "duckdb"     # In-process SQL OLAP database
brew "pstree"     # Display running processes as a tree
brew "opencode"   # AI coding assistant CLI
brew "mc"         # Directory TUI
brew "posting"    # HTTP API TUI, bring the postman website into the term
brew "ncdu"       # TUI replacement for du
brew "btop"       # TUI hardware perf monitor
brew "ntfy"       # CLI to send notifications

# Modern replacements
brew "fd"         # find replacement
brew "ripgrep"    # grep replacement
brew "fzf"        # fuzzy finder
brew "zoxide"     # smarter cd
brew "sd"         # An intuitive find & replace CLI
brew "eza"        # Modern ls replacement with colors and git support
brew "delta"      # Syntax-highlighting pager for git diffs
brew "difftastic" # Structural diff tool that understands syntax
brew "bat"        # cat replacement with syntax highlighting
brew "glow"       # Render markdown in the terminal
brew "just"       # Modern make files
brew "zsh"        # Better Bash
brew "nu"         # Non-POSIX shell focused on making piping amazing

# Build tools
brew "cmake"      # Cross-platform build system generator
brew "automake"   # Generate Makefile.in from Makefile.am
brew "libtool"    # Generic library support script
brew "gnu-tar"    # GNU version of tar archiver
brew "shellcheck" # Static analysis tool for shell scripts
brew "uv"         # Fast Python package installer and resolver
brew "entr"       # Monitor for file changes and run a command

# Cask applications
cask "ghostty"                       # GPU-accelerated terminal emulator
cask "iterm2"                        # Feature-rich terminal emulator for macOS
cask "google-chrome"                 # Web browser
cask "intellij-idea-ce"              # Java IDE by JetBrains
cask "font-jetbrains-mono-nerd-font" # Monospace font with programming ligatures and icons
