# Core CLI tools
brew "git"
brew "neovim"
brew "tmux"
brew "stow"
brew "tree"
brew "curl"
brew "jq"
brew "watch"

# Modern replacements
brew "fd"         # find replacement
brew "ripgrep"    # grep replacement
brew "fzf"        # fuzzy finder
brew "zoxide"     # smarter cd
brew "sd"         # An intuitive find & replace CLI
brew "eza"
brew "delta"
brew "difftastic"
brew "bat"
brew "glow"
brew "just"       # Modern make files

# Build tools
brew "cmake"
brew "automake"
brew "libtool"
brew "gnu-tar"

# Cask applications
cask "ghostty"
cask "iterm2"
cask "google-chrome"
cask "intellij-idea-ce"
